Revit 2027 API
BuiltInFailures.SketchFailures.NotOneCurvePath3d Property
 More than one curve not allowed.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId NotOneCurvePath3d { get; }
Public Shared ReadOnly Property NotOneCurvePath3d As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ NotOneCurvePath3d {
	FailureDefinitionId^ get ();
}
static member NotOneCurvePath3d : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.SketchFailures Class
Autodesk.Revit.DB Namespace